export default {
    // Вказуємо середовище тестування Node.js
    testEnvironment: "node",
  
    // Налаштування трансформацій (необов'язково, якщо Babel не використовується)
    transform: {
        "^.+\\.m?[tj]s$": "babel-jest", // Використовуємо Babel для обробки ESM файлів
      },
  
    // Шляхи, які потрібно ігнорувати для трансформації
    transformIgnorePatterns: [
      "/node_modules/", // Ігноруємо стандартні модулі
    ],
  
    // Пошук тестових файлів
    testMatch: [
      "**/tests/**/*.test.js", // Усі файли в папці `tests` з розширенням `.test.js`
      "**/?(*.)+(spec|test).[jt]s", // Усі файли з суфіксами `.spec.js` або `.test.js`
    ],
  
    // Покриття коду
    collectCoverage: true, // Увімкнення збору покриття
    coverageDirectory: "coverage", // Директорія для збереження результатів покриття
    coverageProvider: "v8", // Використовуємо вбудований інструмент покриття з Node.js
  
    // Логування результатів
    verbose: true, // Виводить розширені логи виконання тестів
  };
  
  